Revit 2027 API
ParameterTypeId.StairsSupportLandingsupportType Property
 "Landing Support Type": Landing Support Type
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static ForgeTypeId StairsSupportLandingsupportType { get; }
Public Shared ReadOnly Property StairsSupportLandingsupportType As ForgeTypeId
	Get
public:
static property ForgeTypeId^ StairsSupportLandingsupportType {
	ForgeTypeId^ get ();
}
static member StairsSupportLandingsupportType : ForgeTypeId with get
Property Value
ForgeTypeId
See Also
Reference
ParameterTypeId Class
Autodesk.Revit.DB Namespace